Revit 2024 API
BuiltInFailures.WallFailures.DisallowedPathCurve Property
 Cannot create stacked elliptical wall with offsets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DisallowedPathCurve { get; }
Visual Basic
Public Shared ReadOnly Property DisallowedPathCurve As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DisallowedPathCurve {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace